backend/docs/system/class/README.md
```mermaid
classDiagram
    class BaseModel {
        <<Abstract>>
        #UUID id
        #Instant createdAt
        #Instant updatedAt
    }

    class SoftDeleteModel {
        <<Abstract>>
        #Instant deletedAt
        +isDeleted() boolean
    }

    class User {
        -String username
        -String email
        -String passwordHash
        -UserRole role
        -boolean isActive
        -boolean isLocked
        -Instant lastSeen
        -UserProfile profile
        +getProfile() UserProfile
        +isEnable() boolean
    }

    class UserProfile {
        <<Embeddable>>
        -String avatarPublicId
        -String avatarUrl
        -String fullName
        -Gender gender
        -LocalDate dateOfBirth
    }

    class RefreshSession {
        <<Redis>>
        -String userId
        -String userRole
    }

    class UserRole {
        <<Enumeration>>
        SUPERUSER
        ADMIN
        USER
        GUEST
    }

    class Gender {
        <<Enumeration>>
        MALE
        FEMALE
    }

    class PresenceStatus {
        <<Enumeration>>
        ONLINE
        IN_ROOM
        PLAYING
        OFFLINE
    }

    class TokenType {
        <<Enumeration>>
        ACCESS
        REFRESH
        GUEST
    }

    BaseModel <|-- SoftDeleteModel
    SoftDeleteModel <|-- User
    User *-- "1" UserProfile : embeds
    User --> UserRole
    UserProfile --> Gender
```
